app/controllers/api/movies_controller.rb

SELECT  "movies".* FROM "movies" ORDER BY "movies"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
    def index
        @movies = Movie.all
        @genres = Genre.all