app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "AsoxjUB_6NKnbO59bcnkhQ"], ["updated_at", "2019-04-02 14:26:50.849598"], ["id", 5]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token!
        self.save!