app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token!
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "iOxdCa_nKt4KblUaLru6Pw"], ["updated_at", "2019-03-27 16:16:15.121491"], ["id", 3]]